liucgg46-glitch/TraceTrackCar_TI/User/Config/empty_mspm0g3519.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0G351X" --package "LQFP-80(PN)" --part "Default"
//@v2CliArgs --device "MSPM0G3519" --package "LQFP-80(PN)"

/**
 * Import the modules used in this configuration.
 */
const Board         = scripting.addModule("/ti/driverlib/Board", {}, false);
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIOA_BOARD   = GPIO.addInstance();
const GPIOB_BOARD   = GPIO.addInstance();
const GPIOC_BOARD   = GPIO.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const MOTOR_PWM     = PWM.addInstance();
const SERVO_PWM     = PWM.addInstance();
const QEI           = scripting.addModule("/ti/driverlib/QEI", {}, false);
const QEI_FRONT_LEFT  = QEI.addInstance();
const QEI_FRONT_RIGHT = QEI.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART_K210     = UART.addInstance();
const UART_E220     = UART.addInstance();
const UART_DEBUG    = UART.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C_SENSOR    = I2C.addInstance();
const SPI           = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI_DISPLAY   = SPI.addInstance();
const SPI_ICM20948  = SPI.addInstance();
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC_GRAY      = ADC12.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK       = scripting.addModule("/ti/driverlib/SYSTICK");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */

Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

GPIOA_BOARD.$name = "GPIO_BOARD_OUTPUTS";
GPIOA_BOARD.port  = "PORTA";
GPIOA_BOARD.associatedPins.create(9);

GPIOA_BOARD.associatedPins[0].$name        = "LED1";
GPIOA_BOARD.associatedPins[0].assignedPin  = "14";
GPIOA_BOARD.associatedPins[0].initialValue = "SET";
GPIOA_BOARD.associatedPins[0].pin.$assign  = "PA14";

GPIOA_BOARD.associatedPins[1].$name        = "LED2";
GPIOA_BOARD.associatedPins[1].assignedPin  = "17";
GPIOA_BOARD.associatedPins[1].initialValue = "SET";
GPIOA_BOARD.associatedPins[1].pin.$assign  = "PA17";

GPIOA_BOARD.associatedPins[2].$name        = "RGB_DATA";
GPIOA_BOARD.associatedPins[2].assignedPin  = "29";
GPIOA_BOARD.associatedPins[2].initialValue = "CLEARED";
GPIOA_BOARD.associatedPins[2].pin.$assign  = "PA29";

GPIOA_BOARD.associatedPins[3].$name        = "LCD_BL";
GPIOA_BOARD.associatedPins[3].assignedPin  = "30";
GPIOA_BOARD.associatedPins[3].initialValue = "CLEARED";
GPIOA_BOARD.associatedPins[3].pin.$assign  = "PA30";

GPIOA_BOARD.associatedPins[4].$name        = "GRAY_S0";
GPIOA_BOARD.associatedPins[4].assignedPin  = "24";
GPIOA_BOARD.associatedPins[4].initialValue = "CLEARED";
GPIOA_BOARD.associatedPins[4].pin.$assign  = "PA24";

GPIOA_BOARD.associatedPins[5].$name        = "GRAY_S1";
GPIOA_BOARD.associatedPins[5].assignedPin  = "31";
GPIOA_BOARD.associatedPins[5].initialValue = "CLEARED";
GPIOA_BOARD.associatedPins[5].pin.$assign  = "PA31";

GPIOA_BOARD.associatedPins[6].$name        = "HX711_SCK";
GPIOA_BOARD.associatedPins[6].assignedPin  = "7";
GPIOA_BOARD.associatedPins[6].initialValue = "CLEARED";
GPIOA_BOARD.associatedPins[6].pin.$assign  = "PA7";

GPIOA_BOARD.associatedPins[7].$name        = "BUZZER";
GPIOA_BOARD.associatedPins[7].assignedPin  = "15";
GPIOA_BOARD.associatedPins[7].initialValue = "SET";
GPIOA_BOARD.associatedPins[7].pin.$assign  = "PA15";
GPIOA_BOARD.associatedPins[8].$name            = "KEY4";
GPIOA_BOARD.associatedPins[8].assignedPin      = "8";
GPIOA_BOARD.associatedPins[8].direction        = "INPUT";
GPIOA_BOARD.associatedPins[8].internalResistor = "PULL_UP";
GPIOA_BOARD.associatedPins[8].pin.$assign      = "PA8";

GPIOB_BOARD.$name = "GPIO_BOARD_IO";
GPIOB_BOARD.port  = "PORTB";
GPIOB_BOARD.associatedPins.create(20);

GPIOB_BOARD.associatedPins[0].$name        = "ICM20948_CS";
GPIOB_BOARD.associatedPins[0].assignedPin  = "12";
GPIOB_BOARD.associatedPins[0].initialValue = "SET";
GPIOB_BOARD.associatedPins[0].pin.$assign  = "PB12";

GPIOB_BOARD.associatedPins[1].$name       = "ICM20948_INT";
GPIOB_BOARD.associatedPins[1].assignedPin = "21";
GPIOB_BOARD.associatedPins[1].direction   = "INPUT";
GPIOB_BOARD.associatedPins[1].interruptEn = true;
GPIOB_BOARD.associatedPins[1].polarity    = "RISE_FALL";
GPIOB_BOARD.associatedPins[1].pin.$assign = "PB21";

GPIOB_BOARD.associatedPins[2].$name            = "USER_KEY";
GPIOB_BOARD.associatedPins[2].assignedPin      = "31";
GPIOB_BOARD.associatedPins[2].direction        = "INPUT";
GPIOB_BOARD.associatedPins[2].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[2].pin.$assign      = "PB31";

GPIOB_BOARD.associatedPins[3].$name        = "MOTOR_FL_IN1";
GPIOB_BOARD.associatedPins[3].assignedPin  = "6";
GPIOB_BOARD.associatedPins[3].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[3].pin.$assign  = "PB6";

GPIOB_BOARD.associatedPins[4].$name        = "MOTOR_FL_IN2";
GPIOB_BOARD.associatedPins[4].assignedPin  = "7";
GPIOB_BOARD.associatedPins[4].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[4].pin.$assign  = "PB7";

GPIOB_BOARD.associatedPins[5].$name        = "MOTOR_FR_IN1";
GPIOB_BOARD.associatedPins[5].assignedPin  = "8";
GPIOB_BOARD.associatedPins[5].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[5].pin.$assign  = "PB8";

GPIOB_BOARD.associatedPins[6].$name        = "MOTOR_FR_IN2";
GPIOB_BOARD.associatedPins[6].assignedPin  = "9";
GPIOB_BOARD.associatedPins[6].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[6].pin.$assign  = "PB9";

GPIOB_BOARD.associatedPins[7].$name        = "MOTOR_RL_IN1";
GPIOB_BOARD.associatedPins[7].assignedPin  = "20";
GPIOB_BOARD.associatedPins[7].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[7].pin.$assign  = "PB20";

GPIOB_BOARD.associatedPins[8].$name        = "MOTOR_RL_IN2";
GPIOB_BOARD.associatedPins[8].assignedPin  = "24";
GPIOB_BOARD.associatedPins[8].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[8].pin.$assign  = "PB24";

GPIOB_BOARD.associatedPins[9].$name        = "MOTOR_RR_IN1";
GPIOB_BOARD.associatedPins[9].assignedPin  = "25";
GPIOB_BOARD.associatedPins[9].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[9].pin.$assign  = "PB25";

GPIOB_BOARD.associatedPins[10].$name        = "MOTOR_RR_IN2";
GPIOB_BOARD.associatedPins[10].assignedPin  = "27";
GPIOB_BOARD.associatedPins[10].initialValue = "CLEARED";
GPIOB_BOARD.associatedPins[10].pin.$assign  = "PB27";

GPIOB_BOARD.associatedPins[11].$name            = "ENCODER_RL_A";
GPIOB_BOARD.associatedPins[11].assignedPin      = "17";
GPIOB_BOARD.associatedPins[11].direction        = "INPUT";
GPIOB_BOARD.associatedPins[11].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[11].inputFilter      = "3_CYCLES";
GPIOB_BOARD.associatedPins[11].interruptEn      = true;
GPIOB_BOARD.associatedPins[11].polarity         = "RISE_FALL";
GPIOB_BOARD.associatedPins[11].pin.$assign      = "PB17";

