liucgg46-glitch/TraceTrackCar_TI/User/Config/empty_mspm0g3519.syscfg
GPIOB_BOARD.associatedPins[12].$name            = "ENCODER_RL_B";
GPIOB_BOARD.associatedPins[12].assignedPin      = "18";
GPIOB_BOARD.associatedPins[12].direction        = "INPUT";
GPIOB_BOARD.associatedPins[12].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[12].inputFilter      = "3_CYCLES";
GPIOB_BOARD.associatedPins[12].interruptEn      = true;
GPIOB_BOARD.associatedPins[12].polarity         = "RISE_FALL";
GPIOB_BOARD.associatedPins[12].pin.$assign      = "PB18";

GPIOB_BOARD.associatedPins[13].$name            = "ENCODER_RR_A";
GPIOB_BOARD.associatedPins[13].assignedPin      = "19";
GPIOB_BOARD.associatedPins[13].direction        = "INPUT";
GPIOB_BOARD.associatedPins[13].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[13].inputFilter      = "3_CYCLES";
GPIOB_BOARD.associatedPins[13].interruptEn      = true;
GPIOB_BOARD.associatedPins[13].polarity         = "RISE_FALL";
GPIOB_BOARD.associatedPins[13].pin.$assign      = "PB19";

GPIOB_BOARD.associatedPins[14].$name            = "ENCODER_RR_B";
GPIOB_BOARD.associatedPins[14].assignedPin      = "22";
GPIOB_BOARD.associatedPins[14].direction        = "INPUT";
GPIOB_BOARD.associatedPins[14].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[14].inputFilter      = "3_CYCLES";
GPIOB_BOARD.associatedPins[14].interruptEn      = true;
GPIOB_BOARD.associatedPins[14].polarity         = "RISE_FALL";
GPIOB_BOARD.associatedPins[14].pin.$assign      = "PB22";

GPIOB_BOARD.associatedPins[15].$name        = "LCD_RESET";
GPIOB_BOARD.associatedPins[15].assignedPin  = "23";
GPIOB_BOARD.associatedPins[15].initialValue = "SET";
GPIOB_BOARD.associatedPins[15].pin.$assign  = "PB23";

GPIOB_BOARD.associatedPins[16].$name            = "E220_AUX";
GPIOB_BOARD.associatedPins[16].assignedPin      = "28";
GPIOB_BOARD.associatedPins[16].direction        = "INPUT";
GPIOB_BOARD.associatedPins[16].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[16].pin.$assign      = "PB28";
GPIOB_BOARD.associatedPins[17].$name            = "KEY1";
GPIOB_BOARD.associatedPins[17].assignedPin      = "0";
GPIOB_BOARD.associatedPins[17].direction        = "INPUT";
GPIOB_BOARD.associatedPins[17].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[17].pin.$assign      = "PB0";

GPIOB_BOARD.associatedPins[18].$name            = "KEY2";
GPIOB_BOARD.associatedPins[18].assignedPin      = "1";
GPIOB_BOARD.associatedPins[18].direction        = "INPUT";
GPIOB_BOARD.associatedPins[18].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[18].pin.$assign      = "PB1";

GPIOB_BOARD.associatedPins[19].$name            = "KEY3";
GPIOB_BOARD.associatedPins[19].assignedPin      = "13";
GPIOB_BOARD.associatedPins[19].direction        = "INPUT";
GPIOB_BOARD.associatedPins[19].internalResistor = "PULL_UP";
GPIOB_BOARD.associatedPins[19].pin.$assign      = "PB13";

GPIOC_BOARD.$name = "GPIO_DISPLAY_GRAY";
GPIOC_BOARD.port  = "PORTC";
GPIOC_BOARD.associatedPins.create(5);

GPIOC_BOARD.associatedPins[0].$name        = "LCD_DC";
GPIOC_BOARD.associatedPins[0].assignedPin  = "8";
GPIOC_BOARD.associatedPins[0].initialValue = "CLEARED";
GPIOC_BOARD.associatedPins[0].pin.$assign  = "PC8";

GPIOC_BOARD.associatedPins[1].$name        = "LCD_CS";
GPIOC_BOARD.associatedPins[1].assignedPin  = "9";
GPIOC_BOARD.associatedPins[1].initialValue = "SET";
GPIOC_BOARD.associatedPins[1].pin.$assign  = "PC9";

GPIOC_BOARD.associatedPins[2].$name        = "GRAY_S2";
GPIOC_BOARD.associatedPins[2].assignedPin  = "1";
GPIOC_BOARD.associatedPins[2].initialValue = "CLEARED";
GPIOC_BOARD.associatedPins[2].pin.$assign  = "PC1";

GPIOC_BOARD.associatedPins[3].$name        = "LASER_EN";
GPIOC_BOARD.associatedPins[3].assignedPin  = "6";
GPIOC_BOARD.associatedPins[3].initialValue = "CLEARED";
GPIOC_BOARD.associatedPins[3].pin.$assign  = "PC6";

GPIOC_BOARD.associatedPins[4].$name            = "HX711_DOUT";
GPIOC_BOARD.associatedPins[4].assignedPin      = "7";
GPIOC_BOARD.associatedPins[4].direction        = "INPUT";
GPIOC_BOARD.associatedPins[4].internalResistor = "PULL_UP";
GPIOC_BOARD.associatedPins[4].pin.$assign      = "PC7";

/*
 * 四路直流电机 PWM 共用 TIMA0，32 MHz / 1600 = 20 kHz。
 * 所有通道初始占空比为 0，避免上电时电机误动作。
 */
MOTOR_PWM.$name                      = "PWM_MOTOR";
MOTOR_PWM.pwmMode                    = "EDGE_ALIGN_UP";
MOTOR_PWM.timerCount                 = 1600;
MOTOR_PWM.timerStartTimer            = true;
MOTOR_PWM.ccIndex                    = [0,1,2,3];
MOTOR_PWM.peripheral.$assign         = "TIMA0";
MOTOR_PWM.peripheral.ccp0Pin.$assign = "PC2";
MOTOR_PWM.peripheral.ccp1Pin.$assign = "PC4";
MOTOR_PWM.peripheral.ccp2Pin.$assign = "PC0";
MOTOR_PWM.peripheral.ccp3Pin.$assign = "PA28";
MOTOR_PWM.PWM_CHANNEL_0.$name        = "MOTOR_PWM_FL";
MOTOR_PWM.PWM_CHANNEL_0.ccValue      = 1600;
MOTOR_PWM.PWM_CHANNEL_1.$name        = "MOTOR_PWM_FR";
MOTOR_PWM.PWM_CHANNEL_1.ccValue      = 1600;
MOTOR_PWM.PWM_CHANNEL_2.$name        = "MOTOR_PWM_RL";
MOTOR_PWM.PWM_CHANNEL_2.ccValue      = 1600;
MOTOR_PWM.PWM_CHANNEL_3.$name        = "MOTOR_PWM_RR";
MOTOR_PWM.PWM_CHANNEL_3.ccValue      = 1600;

/*
 * TIMG0 以 1 MHz 计数、20 ms 周期驱动两路舵机。
 * 初始 compare=LOAD 表示 0% 有效脉冲，避免上电瞬间舵机误动作。
 */
SERVO_PWM.$name                      = "PWM_SERVO";
SERVO_PWM.pwmMode                    = "EDGE_ALIGN_UP";
SERVO_PWM.clockPrescale              = 32;
SERVO_PWM.timerCount                 = 20000;
SERVO_PWM.timerStartTimer            = true;
SERVO_PWM.ccIndex                    = [0,1];
SERVO_PWM.peripheral.$assign         = "TIMG0";
SERVO_PWM.peripheral.ccp0Pin.$assign = "PA12";
SERVO_PWM.peripheral.ccp1Pin.$assign = "PA13";
SERVO_PWM.PWM_CHANNEL_0.$name        = "SERVO_HORIZONTAL";
SERVO_PWM.PWM_CHANNEL_0.ccValue      = 20000;
SERVO_PWM.PWM_CHANNEL_1.$name        = "SERVO_PITCH";
SERVO_PWM.PWM_CHANNEL_1.ccValue      = 20000;

/*
 * MSPM0G3519 只有 TIMG8/TIMG9 两组硬件 QEI。
 * 先将它们固定给左右前轮；4WD 后轮后续使用 GPIO 双边沿软件解码。
 */
QEI_FRONT_LEFT.$name                      = "QEI_FRONT_LEFT";
QEI_FRONT_LEFT.timerStartTimer            = true;
QEI_FRONT_LEFT.peripheral.$assign         = "TIMG8";
QEI_FRONT_LEFT.peripheral.ccp0Pin.$assign = "PA26";
QEI_FRONT_LEFT.peripheral.ccp1Pin.$assign = "PA27";

QEI_FRONT_RIGHT.$name                      = "QEI_FRONT_RIGHT";
QEI_FRONT_RIGHT.timerStartTimer            = true;
QEI_FRONT_RIGHT.peripheral.$assign         = "TIMG9";
QEI_FRONT_RIGHT.peripheral.ccp0Pin.$assign = "PB29";
QEI_FRONT_RIGHT.peripheral.ccp1Pin.$assign = "PB30";

