liucgg46-glitch/TraceTrackCar_TI/User/Config/empty_mspm0g3519.syscfg
/*
 * 三路 UART 独立分工，均为 115200-8-N-1：
 * UART0：板载 CH340 / Type-C 调试串口，PA10 TX、PA11 RX；
 * UART1：K210，PB4 TX、PB5 RX；
 * UART4：E220，PB10 TX、PB11 RX。
 */
UART_DEBUG.$name                    = "UART_DEBUG";
UART_DEBUG.targetBaudRate           = 115200;
UART_DEBUG.enableFIFO               = true;
UART_DEBUG.rxFifoThreshold          = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART_DEBUG.txFifoThreshold          = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART_DEBUG.enabledInterrupts        = ["RX","TX"];
UART_DEBUG.peripheral.$assign       = "UART0";
UART_DEBUG.peripheral.txPin.$assign = "PA10";
UART_DEBUG.peripheral.rxPin.$assign = "PA11";

UART_K210.$name                    = "UART_K210";
UART_K210.targetBaudRate           = 115200;
UART_K210.enableFIFO               = true;
UART_K210.rxFifoThreshold          = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART_K210.txFifoThreshold          = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART_K210.enabledInterrupts        = ["RX","TX"];
UART_K210.peripheral.$assign       = "UART1";
UART_K210.peripheral.txPin.$assign = "PB4";
UART_K210.peripheral.rxPin.$assign = "PB5";

UART_E220.$name                    = "UART_E220";
UART_E220.targetBaudRate           = 115200;
UART_E220.enableFIFO               = true;
UART_E220.rxFifoThreshold          = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART_E220.txFifoThreshold          = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART_E220.enabledInterrupts        = ["RX","TX"];
UART_E220.peripheral.$assign       = "UART4";
UART_E220.peripheral.txPin.$assign = "PB10";
UART_E220.peripheral.rxPin.$assign = "PB11";

/* 传感器公共 I2C：OLED、VL53L1X、可选灰度 MCU 共用 400 kHz 总线。 */
I2C_SENSOR.$name                           = "I2C_SENSOR";
I2C_SENSOR.basicEnableController           = true;
I2C_SENSOR.basicControllerStandardBusSpeed = "Fast";
I2C_SENSOR.advAnalogGlitchFilter           = "DISABLED";
I2C_SENSOR.peripheral.$assign              = "I2C0";
I2C_SENSOR.peripheral.sdaPin.$assign       = "PA0";
I2C_SENSOR.peripheral.sclPin.$assign       = "PA1";
I2C_SENSOR.sdaPinConfig.enableConfig       = true;
I2C_SENSOR.sclPinConfig.enableConfig       = true;
I2C_SENSOR.DMAEvent1                       = "CONTROLLER_TXFIFO_TRIGGER";
I2C_SENSOR.DMAEvent2                       = "CONTROLLER_RXFIFO_TRIGGER";
I2C_SENSOR.intController                   = ["ARBITRATION_LOST","NACK","RX_DONE","TX_DONE"];
I2C_SENSOR.DMA_CHANNEL_EVENT1.$name        = "DMA_CH2";
I2C_SENSOR.DMA_CHANNEL_EVENT1.addressMode  = "b2f";
I2C_SENSOR.DMA_CHANNEL_EVENT1.srcLength    = "BYTE";
I2C_SENSOR.DMA_CHANNEL_EVENT1.dstLength    = "BYTE";
I2C_SENSOR.DMA_CHANNEL_EVENT1.peripheral.$assign = "DMA_CH2";
I2C_SENSOR.DMA_CHANNEL_EVENT2.$name        = "DMA_CH3";
I2C_SENSOR.DMA_CHANNEL_EVENT2.addressMode  = "f2b";
I2C_SENSOR.DMA_CHANNEL_EVENT2.srcLength    = "BYTE";
I2C_SENSOR.DMA_CHANNEL_EVENT2.dstLength    = "BYTE";
I2C_SENSOR.DMA_CHANNEL_EVENT2.peripheral.$assign = "DMA_CH3";

/*
 * 外接 ICM20948 使用 SPI1；显示屏使用 SPI0。
 * 两个 CS 都由 GPIO 软件控制，便于复用现有设备驱动事务边界。
 */
SPI_ICM20948.$name                      = "SPI_ICM20948";
SPI_ICM20948.targetBitRate              = 4000000;
SPI_ICM20948.rxFifoThreshold            = "DL_SPI_RX_FIFO_LEVEL_ONE_FRAME";
SPI_ICM20948.txFifoThreshold            = "DL_SPI_TX_FIFO_LEVEL_ONE_FRAME";
SPI_ICM20948.peripheral.$assign         = "SPI1";
SPI_ICM20948.peripheral.sclkPin.$assign = "PB16";
SPI_ICM20948.peripheral.mosiPin.$assign = "PB15";
SPI_ICM20948.peripheral.misoPin.$assign = "PB14";

SPI_DISPLAY.$name                      = "SPI_DISPLAY";
/* TFT 只发送，不需要 POCI/MISO；释放 PA10 给 UART0_TX。 */
SPI_DISPLAY.direction                  = "PICO";
SPI_DISPLAY.targetBitRate              = 8000000;
SPI_DISPLAY.rxFifoThreshold            = "DL_SPI_RX_FIFO_LEVEL_ONE_FRAME";
SPI_DISPLAY.txFifoThreshold            = "DL_SPI_TX_FIFO_LEVEL_ONE_FRAME";
SPI_DISPLAY.enabledDMAEvent1Triggers   = "DL_SPI_DMA_INTERRUPT_RX";
SPI_DISPLAY.enabledDMAEvent2Triggers   = "DL_SPI_DMA_INTERRUPT_TX";
SPI_DISPLAY.enabledInterrupts          = ["DMA_DONE_RX","DMA_DONE_TX","TX_EMPTY"];
SPI_DISPLAY.DMA_CHANNEL_EVENT1.$name   = "DMA_CH1";
SPI_DISPLAY.DMA_CHANNEL_EVENT1.addressMode = "f2b";
SPI_DISPLAY.DMA_CHANNEL_EVENT1.srcLength   = "BYTE";
SPI_DISPLAY.DMA_CHANNEL_EVENT1.dstLength   = "BYTE";
SPI_DISPLAY.DMA_CHANNEL_EVENT1.peripheral.$assign = "DMA_CH1";
SPI_DISPLAY.DMA_CHANNEL_EVENT2.$name   = "DMA_CH0";
SPI_DISPLAY.DMA_CHANNEL_EVENT2.addressMode = "b2f";
SPI_DISPLAY.DMA_CHANNEL_EVENT2.srcLength   = "BYTE";
SPI_DISPLAY.DMA_CHANNEL_EVENT2.dstLength   = "BYTE";
SPI_DISPLAY.DMA_CHANNEL_EVENT2.peripheral.$assign = "DMA_CH0";
SPI_DISPLAY.peripheral.$assign         = "SPI0";
SPI_DISPLAY.peripheral.sclkPin.$assign = "PB3";
SPI_DISPLAY.peripheral.mosiPin.$assign = "PB2";

/* 74HC4051 的模拟输出只占一路 ADC；S0/S1/S2 由 GPIO 切换。 */
ADC_GRAY.$name                       = "ADC_GRAY";
ADC_GRAY.sampClkSrc                  = "DL_ADC12_CLOCK_SYSOSC";
ADC_GRAY.sampClkDiv                  = "DL_ADC12_CLOCK_DIVIDE_8";
ADC_GRAY.sampleTime0                 = "125 us";
ADC_GRAY.adcMem0chansel              = "DL_ADC12_INPUT_CHAN_2";
ADC_GRAY.powerDownMode               = "DL_ADC12_POWER_DOWN_MODE_MANUAL";
ADC_GRAY.peripheral.$assign          = "ADC0";
ADC_GRAY.peripheral.adcPin2.$assign  = "PA25";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn           = true;

/* 32 MHz 默认系统时钟下，32000 个周期产生 1 ms 系统节拍。 */
SYSTICK.period          = 32000;
SYSTICK.periodEnable    = true;
SYSTICK.systickEnable   = true;
SYSTICK.interruptEnable = true;

ProjectConfig.deviceSpin = "MSPM0G3519";
